app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('minh', '$2a$10$XhpJnY93O9TBXS/ehnNwHOIsJ1vZHIo2OTRnZMtVkGs4XvXsCRzZW', '2018-04-25 06:13:35', '2018-04-25 06:13:35')

  def show
    @user = User.find_by id: params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1